import React from 'react';
import Container from 'react-bootstrap/Container';
import SharedHelmet from '../common/Helmet';
import { websiteDomain, websiteURL } from '../common/constants';

const TITLE = 'سياسة الخصوصية';
const DESCRIPTION = 'سياسة الخصوصية الخاصة بموقع مواعيد وكيفية تعاملنا مع بياناتكم.';
const KEYWORDS = 'سياسة الخصوصية, بيانات شخصية, أمن المعلومات';
const OG_URL = `${websiteURL}/privacy/`;

const PrivacyPolicy = () => {
  return (
    <Container style={{ direction: 'rtl' }}>
      <SharedHelmet TITLE={TITLE} DESCRIPTION={DESCRIPTION} KEYWORDS={KEYWORDS} OG_URL={OG_URL} />
      <div>
        <h1 style={{
          backgroundColor: '#65bee7',
          color: '#ffffff',
          height: '80px',
          display: 'flex',
          alignItems: 'center',
          justifyContent: 'center',
          fontSize: '1.5rem',
          fontWeight: 'bold',
          textAlign: 'center',
          textShadow: '1px 1px 4px rgba(0, 0, 0, 0.2)',
          padding: '0 10px',
          borderRadius: '8px',
          boxShadow: '0 4px 8px rgba(0, 0, 0, 0.2)',
          backgroundImage: 'linear-gradient(to right, #65bee7, #4ca3d3)',
          width: '100%',
          maxWidth: '800px',
          margin: '0 auto',
        }}>
          سياسة الخصوصية
        </h1>
        <br />
        <p>
          نقدر استفساراتكم واهتماماتكم بخصوص خصوصية بياناتكم على الإنترنت. تم إعداد هذه السياسة لتوضيح كيفية تعاملنا مع البيانات الشخصية التي نقوم بتجميعها خلال زيارتكم لموقعنا. نحن ملتزمون بحماية خصوصيتكم ونعمل على اتخاذ كافة التدابير اللازمة لضمان سرية معلوماتكم.
        </p>

        <h2 style={{fontSize:'22px'}}>عملية التصفح</h2>
        <p>
          لم يتم تصميم الموقع لجمع بيانات شخصية من جهاز الكمبيوتر أثناء تصفحك. سنستخدم فقط البيانات التي تقدمونها بمعرفتكم وبموافقتكم، مثل بيانات التسجيل أو الاستفسارات التي تقومون بإرسالها.
        </p>

        <h2 style={{fontSize:'22px'}}>عنوان بروتوكول شبكة الإنترنت (IP)</h2>
        <p>
          عند زيارتك لأي موقع على الإنترنت، يُسجل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، وتاريخ ووقت الزيارة، نوع المتصفح، وعنوان URL للمواقع التي أحيلتم منها إلى موقعنا. يتم استخدام هذه المعلومات لأغراض تحليلية وتحسين تجربة المستخدم.
        </p>

        <h2 style={{fontSize:'22px'}}>عمليات المسح على الشبكة</h2>
        <p>
          تُستخدم عمليات المسح على الشبكة لجمع بيانات حول آرائكم وتقييمكم للموقع. إن مشاركاتكم وتعليقاتكم تلعبان دورًا هامًا في تحسين جودة الموقع وتلبية احتياجات المستخدمين.
        </p>

        <h2 style={{fontSize:'22px'}}>الروابط إلى مواقع أخرى</h2>
        <p>
          يحتوي موقعنا على روابط إلى مواقع أخرى على الإنترنت. نود التنويه أننا غير مسؤولين عن جمع بيانات تلك المواقع أو ممارسات الخصوصية الخاصة بها، لذا نوصي بمراجعة سياسات الخصوصية لتلك المواقع.
        </p>

        <h2 style={{fontSize:'22px'}}>الإعلانات من الأطراف الثالثة</h2>
        <p>
          نستخدم شركات إعلانات لتقديم إعلانات عند زيارتكم للموقع. قد تستخدم هذه الشركات معلومات حول زياراتكم لتقديم إعلانات تتناسب مع اهتماماتكم. نحن لا نتشارك معلوماتكم الشخصية مع هذه الشركات.
        </p>

        <h2 style={{fontSize:'22px'}}>إفشاء المعلومات</h2>
        <p>
          سنحتفظ دائمًا بسرية البيانات الشخصية التي نحصل عليها، ولن نفشي تلك المعلومات إلا إذا كان ذلك مطلوبًا بموجب القانون أو لحماية حقوق الملكية الفكرية. نحن نؤمن بأهمية الحفاظ على خصوصية مستخدمينا.
        </p>

        <h2 style={{fontSize:'22px'}}>البيانات الضرورية لتنفيذ المعاملات</h2>
        <p>
          عند الحاجة إلى بيانات خاصة بكم، سنطلبها بموافقتكم. هذه البيانات تساعدنا في تنفيذ طلباتكم بشكل أسرع وأكثر فعالية. لن يتم بيع البيانات أو استخدامها دون موافقتكم، إلا لأغراض إحصائية دون التعرف عليكم.
        </p>

        <h2 style={{fontSize:'22px'}}>التعديلات على سياسة الخصوصية</h2>
        <p>
          نحتفظ بحق تعديل بنود سياسة الخصوصية وسرية المعلومات. سنقوم بإشعاركم بأي تغييرات تطرأ على هذه السياسة، ونشجعكم على مراجعتها بانتظام.
        </p>

        <h2 style={{fontSize:'22px'}}>الاتصال بنا</h2>
        <p>
          يمكنكم الاتصال بنا عبر البريد الإلكتروني: <a href={`mailto:info@${websiteDomain}`} style={{ color: '#007bff', textDecoration: 'none' }}>info@{websiteDomain}</a>. نحن هنا للإجابة على أي استفسارات أو مخاوف قد تكون لديكم.
        </p>

        <h2 style={{fontSize:'22px'}}>في الختام</h2>
        <p>
          نؤكد على أهمية خصوصية بياناتكم، ونسعى لتقديم أفضل تجربة ممكنة لكم. نأمل أن تحقق هذه السياسة من تلبية مخاوفكم واهتماماتكم. شكراً لثقتكم بنا ونتطلع إلى تقديم خدمات متميزة لكم.
        </p>
      </div>
    </Container>
  );
};

export default PrivacyPolicy;
